In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd. DataFrame(np.random.randint(-2, 8, (5,4)), 
                  index = ['A', 'B','C', 'D', 'E'],
                  columns = ['W', 'X','Y', 'Z'])

In [3]:
df

   W  X  Y  Z
A  0  7  0  5
B -2  0  0  7
C -1  1  2 -1
D  1 -1 -1  6
E -2 -1  7  1

In [4]:
df[df > 0]

     W    X    Y    Z
A  NaN  7.0  NaN  5.0
B  NaN  NaN  NaN  7.0
C  NaN  1.0  2.0  NaN
D  1.0  NaN  NaN  6.0
E  NaN  NaN  7.0  1.0

In [5]:
df['X'] > 0

A     True
B    False
C     True
D    False
E    False
Name: X, dtype: bool

In [6]:
df[df['Y'] < 0]

   W  X  Y  Z
D  1 -1 -1  6

In [7]:
df[df['Y'] < 0]['X']

D   -1
Name: X, dtype: int32

In [8]:
df[df['Y'] < 0][['X', 'Y']]

   X  Y
D -1 -1

In [9]:
df[(df['X'] > 0) & (df ['Y'] > 1)]

   W  X  Y  Z
C -1  1  2 -1

In [10]:
df[(df['X'] > 0) | (df ['Y'] > 1)]

   W  X  Y  Z
A  0  7  0  5
C -1  1  2 -1
E -2 -1  7  1

In [11]:
df.reset_index()

  index  W  X  Y  Z
0     A  0  7  0  5
1     B -2  0  0  7
2     C -1  1  2 -1
3     D  1 -1 -1  6
4     E -2 -1  7  1

In [12]:
df

   W  X  Y  Z
A  0  7  0  5
B -2  0  0  7
C -1  1  2 -1
D  1 -1 -1  6
E -2 -1  7  1

In [13]:
df.reset_index(inplace = True)

In [14]:
df

  index  W  X  Y  Z
0     A  0  7  0  5
1     B -2  0  0  7
2     C -1  1  2 -1
3     D  1 -1 -1  6
4     E -2 -1  7  1

In [15]:
df

  index  W  X  Y  Z
0     A  0  7  0  5
1     B -2  0  0  7
2     C -1  1  2 -1
3     D  1 -1 -1  6
4     E -2 -1  7  1

In [16]:
df =pd.DataFrame({'Name': ['Jane', 'Jack', 'Carol', np.nan, np.nan], 'Age': [ 59, 15, 26, 32, 19]})

In [17]:
df

    Name  Age
0   Jane   59
1   Jack   15
2  Carol   26
3    NaN   32
4    NaN   19

In [18]:
newindex = ['India', 'Nepal', 'India', 'Thailand', 'Indonesia']

In [19]:
newindex

['India', 'Nepal', 'India', 'Thailand', 'Indonesia']

In [20]:
df['Country'] = newindex

In [21]:
df

    Name  Age    Country
0   Jane   59      India
1   Jack   15      Nepal
2  Carol   26      India
3    NaN   32   Thailand
4    NaN   19  Indonesia

In [22]:
(df['Country'] == 'India') & (df ['Age'] > 50) # select cases where nationality is Indian and age above 50

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [23]:
df[(df['Country'] == 'India') & (df ['Age'] > 50)]

   Name  Age Country
0  Jane   59   India

In [24]:
df['Country'] == 'India'

0     True
1    False
2     True
3    False
4    False
Name: Country, dtype: bool

In [25]:
df[df['Country'] == 'India']

    Name  Age Country
0   Jane   59   India
2  Carol   26   India

In [26]:
df

    Name  Age    Country
0   Jane   59      India
1   Jack   15      Nepal
2  Carol   26      India
3    NaN   32   Thailand
4    NaN   19  Indonesia

In [27]:
df[(df['Name'].notnull()) & (df['Country'] == 'India')]

    Name  Age Country
0   Jane   59   India
2  Carol   26   India

In [28]:
df[df['Country'] == 'Nepal']

   Name  Age Country
1  Jack   15   Nepal

In [29]:
df.set_index('Country')

            Name  Age
Country
India       Jane   59
Nepal       Jack   15
India      Carol   26
Thailand     NaN   32
Indonesia    NaN   19